#include <iostream>
using namespace std;
int n,k;
int a[10001];
int d[101][10001];      // use untill i, limit j
// d[i][j] = d[i-1][j-1] + d[i-2][j-2] .....
int main(){
    cin >> n >> k;
    for(int i=1; i<=n; i++){
        cin >> a[i];
    }
    d[0][0] = 1;

    for(int i=1; i<=n; i++){
        for(int j=1; j<=k; j++){
            if(j >= a[i]){
                //d[i][j] :  i 번째 동전까지만 사용해서 j 원만큼 표현하는 방법의 가지수
                d[i][j] += d[i-1][j - a[i]];
            }
            d[i][j] += d[i-1][j];
            // d[3][10]: d[2][5], d[2][10], d[2][0]
                                                            //d[2][10] d[1][5] 
                                                        //d[3][5]: 1 1 1 1 1, 1 1 1 2, 1 2 2, 5
                                                        //d[2][0]: 
                                                        //d[1][4]: 1 1 1 1
                                                        //d[2][5]: 1 1 1 1 1, 1 1 1 2, 1 2 2
        }
    }
    for(int i=1; i<= n; i++){
        for(int j=1; j<=k; j++){
            cout << d[i][j] << " ";
        }
        cout << endl;
    }
    cout << d[n][k] << endl;
    return 0;
}
// 1 2 3 4 1 2 3 4 5 2 
// 1 2 2 3 3 5 6
// 1 1
// 2 11, 2
// 3 111, 12
// 4 1111, 112, 22
// 5 11111, 1112, 122, 5
// 6 111111, 11112, 1122, 15, 222
// 7 1111111, 111112, 11122, 1222, 115, 25

//5: 11111, 1112, 122, 5

// x + 2y + 5z